{
    "en":{
        "idWeb": "WEB",
        "idDev": "DEVELOPER",
        "idLearn": "LEARN",
        "idMore": "MORE",
        "idAbout": "ABOUT",
        "idProjects": "PROJECTS",
        "idSlash": "/",
        "idTidbits": "TIDBITS",
        "idSkills": "SKILLS",
        "idArrow": "-&gt;",
        "idTalent": "TALENT",
        "idContact": "CONTACT",
        "idMe": "ME",
        "idForm": "FORM",
        "idAus": "\"Australia\"",
        "idCurLoc": ">Mitch.currentLocation",
        "idLang": ">Mitch.languages",
        "idFrEn": "[\"English\", \"French\"]",
        "idInter": ">Mitch.intrests",
        "idintArr": "[\"reading\", \"cooking\", \"rocket league\", \"web development\"]",
        "idProjheader": "Projects",
        "idPrac": "Practice makes perfect",
        "tala": "Visit the site",
        "idProj1": "Funkiwi is a site that acts as a central location for users to find recreation/social activities from various vendors and by buying credits spend them over a wide range of activities. My brief was to create an admin tool to review users survey responses and connections they made during activities where they participated together. The tool would allow the communication team to have leads to populate activities with like minded people who enjoyed similar activities.",
        "idProj2": "Sortir.fr was a group project to create a platform for students of the school to create and manage events over various campuses. The brief required creating a database schema and data modelling, a backend to manage the business logic and a front end for the users to interact with. Particular key points were implementing best practices for data and user security, managing a wide range of users with different roles and managing event data(dates, max attendance, locations etc).",
        "idProj3": "ENI-Encheres was another group project that required building an auction site similar to Ebay. This project came with various challenges particularly writing the whole project without a framework and using JSPs. Highlights of the projects were creating users objects and managing data flow through the application with data validation and security being the primary focus points. Also requiring managing states of items and real time tracking of the clients account balance which was a points based system.",
        "idProj4": "This portfolio, I worked hard on the design aspect and front end functionality as this is just a static site and does not need a backend. Its focus was primarily on usability and responsive design.",
        "idContMe": "Contact Me",
        "idTouch": "Get in touch",
        "idName": "NAME",
        "idContSent": "Thanks for getting in touch, i'll get back to you soon. In the mean time check out my Github, Linkedin or CV.",
        "error-message": "There was an unforeseen error please try again at another time."
    },
    "fr":{
        "idWeb": "DEVELOPPEUR",
        "idDev": "WEB ",
        "idLearn": "ME",
        "idMore": "-&gt;",
        "idAbout": "CONCERNANT",
        "idProjects": "PROJETS",
        "idSlash": "//",
        "idTidbits": "TIDBITS",
        "idSkills": "COMPETENCES",
        "idArrow": "",
        "idTalent": "-&gt;",
        "idContact": "CONTACTER",
        "idMe": "-&gt;",
        "idForm": "ME",
        "idAus": "\"Australie\"",
        "idCurLoc": ">Mitch.positionActuelle",
        "idLang": ">Mitch.langages",
        "idFrEn": "[\"L'anglais\", \"Le français\"]",
        "idInter": ">Mitch.intérêts",
        "idintArr": "[\"lecture\", \"cuisine\", \"rocket league\", \"développement web\"]",
        "idProjheader": "Projets",
        "idPrac": "C'est en forgeant qu'on devient forgeron",
        "tala": "Visiter le site",
        "idProj1": "Talabanane est un site internet qui agit comme une place centrale où les utilisateurs peuvent trouver des activités récréationnelles/sociales de différents prestataires et en achetant des crédits, ils peuvent les dépenser en s&apos;inscrivant à un large choix d&apos;activités. Ma mission était de créer un outil d&apos;administration pour analyser les réponses aux sondages et les différentes connexions qui peuvent être établies entre les utilisateurs lorsqu&apos;ils participaient aux mêmes activités. Cet outil a permis à l&apos;équipe de communication de générer des pistes pour accroître le nombre de présences aux activités en se basant sur les données des utilisateurs ayant des activités communes.",
        "idProj2": "Sortir.fr était un projet de groupe qui consistait à créer une plateforme pour les étudiants de l&apos;école afin qui puisse lancer et gérer des évènements sur les différents campus. La mission nécessitait la création d'un schéma de base de données et d&apos;une modélisation des données, mais aussi celle d&apos;un back-end pour gérer la logique du business et d&apos;un front-end afin que les utilisateurs puissent interagir avec. Les points clés étaient d'implémenter les meilleures pratiques pour la sécurité des données utilisateurs, de manier un large nombre d&apos;utilisateurs avec différents rôles et de gérer les données des évènements (dates, capacité maximum lieux etc…)",
        "idProj3": "ENI-Encheres était un autre travail de groupe qui nécessitait la réalisation d&apos;un site aux enchères similaire à eBay. Ce projet avait plusieurs challenges notamment la rédaction du code de l&apos;entièreté du projet sans structure logicielle ni JSPs. Les points marquants de ce projet étaient la création d&apos;objets utilisateurs et la gestion du flux des données à travers l&apos;application tout en respectant la validation des données et la sécurité comme points primaires. Par ailleurs, la gestion du statut des articles et du suivi en temps réel de la balance des comptes clients étaient basés sur un système de points.",
        "idProj4": "Sur ce portfolio, j&apos;ai travaillé dur sur l&apos;aspect visuel et les fonctionnalités front-end car il s&apos;agit d&apos;un site statique qui ne nécessite pas de back-end. L&apos;accent est porté principalement sur la facilité de navigation et le design réactif.",
        "idContMe": "Me contacter",
        "idTouch": "Prendre contact",
        "idName": "NOM",
        "idContSent": "Merci de m'avoir contacté, je reviendrai vers vous dans les plus brefs délais.\r\nN'hésitez pas à visiter mes comptes Github, Linkedin et à télécharger mon CV.",
        "error-message": "Il y a eu une erreur imprévue veuillez réessayer à un autre moment."
    },
    "err":{
        "en":{
            "other": "This field cannot be left blank",
            "email": "Please input a valid email  address"
        },
        "fr":{
            "other": "Ce champ ne peut pas être laissé vide",
            "email": "Veuillez saisir une adresse e-mail valide"
        }
    }
}

